Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: The driver provides a negative active enable pin ENN to safely switch off all power MOSFETs.
it_it: Il driver fornisce un pin di abilitazione attivo negativo ENN per spegnere in sicurezza tutti i MOSFET di potenza.

source: The driving motor #1 that is under parameterization is driven with nominal current (100%).
it_it: Il motore di azionamento #1 in fase di parametrizzazione viene azionato con corrente nominale (100%).

source: The duration of the index pulse corresponds to the duration of the microstep.
it_it: La durata dell'impulso indice corrisponde alla durata del micropasso.

source: The electromagnetic field of the stepper moves or pushes the rotor.
it_it: Il campo elettromagnetico del motore passo-passo muove o spinge il rotore.

source: The encoder can be used for homing of the motion controller (alternatively to reference switches) and for consistency checks on-the-fly between encoder position and ramp generator position.
it_it: L'encoder può essere utilizzato per l'homing del motion controller (in alternativa agli switch di riferimento) e per i controlli di coerenza al volo tra la posizione dell'encoder e quella del generatore di rampa.

source: The encodings for these parameters allow the coil currents to be increased much more quickly than decreased, because crossing the lower threshold is a more serious event that may require a faster response.
it_it: Le codifiche di questi parametri consentono di aumentare le correnti della bobina molto più rapidamente che di diminuirle, poiché il superamento della soglia inferiore è un evento più grave che potrebbe richiedere una risposta più rapida.

source: The extremely smooth motion of StealthChop is beneficial for many applications.
it_it: Il movimento estremamente fluido di StealthChop è vantaggioso per molte applicazioni.

source: The feed forward velocity-controlled mode will not react to a change of the supply voltage or to events like a motor stall, but it provides very stable amplitude.
it_it: La modalità feed forward con controllo della velocità non reagisce a variazioni della tensione di alimentazione o a eventi come lo stallo del motore, ma fornisce un'ampiezza molto stabile.

source: The filter should always be enabled when high-precision measurement is required.
it_it: Il filtro deve essere sempre abilitato quando è richiesta una misurazione ad alta precisione.

source: The filter should be disabled when rapid response to increasing load is required and for best results of sensorless homing using StallGuard.
it_it: Il filtro deve essere disabilitato quando è richiesta una risposta rapida all'aumento del carico e per ottenere i migliori risultati di homing senza sensori utilizzando StallGuard.

source: The filtering is disabled, and a change of load is detected within a quarter electrical period that is one full step.
it_it: Il filtraggio è disabilitato e una variazione del carico viene rilevata entro un quarto di periodo elettrico, ovvero un passo completo.

source: The filtering is enabled, and a change of load is detected within an electrical period.
it_it: Il filtraggio è abilitato e una variazione del carico viene rilevata entro un periodo elettrico.

source: The first parameter is called smart energy current minimum.
it_it: Il primo parametro si chiama corrente minima Smart Energy.

source: The following conventions are used in this document:
it_it: Nel presente documento vengono utilizzate le seguenti convenzioni:

source: The following example shows initialization for the driver with node address 1 (NAI pin high).
it_it: L'esempio seguente mostra l'inizializzazione del driver con indirizzo di nodo 1 (pin NAI alto).

source: The following must be understood before using SSI:
it_it: Prima di utilizzare SSI, è necessario comprendere quanto segue:

source: The following plots are done with a setup of two mechanical coupled stepper motors of the same type (according to Figure 2.4 and Figure 2.5) running with a slightly different speed (v#1 of motor 1 = 1.001 * v#2 of motor #2) and different currents.
it_it: I grafici seguenti sono stati realizzati con una configurazione di due motori passo-passo accoppiati meccanicamente dello stesso tipo (secondo la Figura 2.4 e la Figura 2.5) che funzionano a velocità leggermente diverse (v#1 del motore 1 = 1,001 * v#2 del motore #2) e correnti diverse.

source: The following sections describe the basic hardware layer (signals and handshaking) first, followed by software protocol, and finishing with a description of message packets.
it_it: Le sezioni seguenti descrivono innanzitutto il livello hardware di base (segnali e handshaking), seguito dal protocollo software e, infine, una descrizione dei pacchetti di messaggi.

source: The following table lists the available SSI commands alphabetically.
it_it: La tabella seguente elenca i comandi SSI disponibili in ordine alfabetico.

source: The following tables list allowable decoder and host responses.
it_it: Le tabelle seguenti elencano le risposte consentite dal decoder e dall'host.

source: The four hardware signals are used to perform host transmission to decoder, and decoder transmission to host.
it_it: I quattro segnali hardware vengono utilizzati per eseguire la trasmissione dall'host al decoder e viceversa.

source: The functional practical application of the settings is detailed in dedicated chapters.
it_it: L'applicazione pratica e funzionale delle impostazioni è descritta in dettaglio in capitoli dedicati.

source: The general packet format for SSI messages is as follows:
it_it: Il formato generale dei pacchetti per i messaggi SSI è il seguente:

source: The graphs are taken from our TMCL-IDE 3.2.0.0 evaluation software.
it_it: I grafici sono tratti dal nostro software di valutazione TMCL-IDE 3.2.0.0.

source: The hardware layer of SSI consists of four signals: Transmit Data (TXD), Receive Data (RXD), Request to Send (RTS) and Clear to Send (CTS).
it_it: Il layer hardware di SSI è costituito da quattro segnali: Transmit Data (TXD), Receive Data (RXD), Request to Send (RTS) [Richiesta di invio] e Clear to Send (CTS) [Pronto all'invio].

source: The homing of a linear drive requires moving the motor into the direction of a hard stop.
it_it: L'homing di un azionamento lineare richiede lo spostamento del motore nella direzione di un fine-corsa.

source: The host ACK/NAKs each packet in a strict transaction-based method.
it_it: L'host conferma l'ACK/NAK di ogni pacchetto con un metodo rigorosamente basato sulle transazioni.

source: The host acknowledges the transmission, or requests the entire multi-packet message be resent from the first packet.
it_it: L'host conferma la trasmissione o richiede che l'intero messaggio multi-pacchetto venga reinviato a partire dal primo pacchetto.

source: The host can also interrupt an incoming message by asserting HOST RTS.
it_it: L'host può anche interrompere un messaggio in arrivo attivando HOST RTS.

source: The host can temporarily hold off the decoder transmission by keeping the HOST RTS line asserted.
it_it: L'host può sospendere temporaneamente la trasmissione del decoder mantenendo attiva la linea HOST RTS.

source: The host changes the state of the HOST RTS line from inactive to active.
it_it: L'host modifica lo stato della linea HOST RTS da inattiva ad attiva.

source: The host is the Bus Master and controls the actions of SSI.
it_it: L'host è il Bus Master e controlla le azioni dell'SSI.

source: The host may also send these beep codes as part of the PARAM_SEND directive.
it_it: L'host può anche inviare questi segnali acustici come parte della direttiva PARAM_SEND.

source: The host may briefly toggle the state of the RTS line during this transaction, as long as the inter-character timeout is not exceeded.
it_it: L'host può modificare brevemente lo stato della linea RTS durante questa transazione, purché non venga superato il timeout tra caratteri.

source: The host may cancel this by transmitting a CMD_NAK Cancel.
it_it: L'host può annullarla trasmettendo un CMD_NAK Cancel.

source: The host may stop the transmission from the decoder at any time by asserting hardware handshaking.
it_it: L'host può interrompere la trasmissione dal decoder in qualsiasi momento attivando l'handshaking hardware.

source: The host may temporarily hold off the decoder transmission by making the HOST RTS line active until it is ready to receive.
it_it: L'host può sospendere temporaneamente la trasmissione del decoder attivando la linea HOST RTS finché non è pronta a ricevere.

source: The host may then take remedial action, which may include determining and resetting all parameters via the SSI interface.
it_it: L'host può quindi intraprendere azioni correttive, che possono includere la determinazione e la reimpostazione di tutti i parametri tramite l'interfaccia SSI.

source: The host must be ready to receive data from the decoder anytime the host is not transmitting.
it_it: L'host deve essere pronto a ricevere dati dal decoder ogni volta che non sta trasmettendo.

source: The host must re-assemble these packets into one message.
it_it: L'host deve riassemblare questi pacchetti in un unico messaggio.

source: The host programmer should adhere to these specifications closely.
it_it: Il programmatore dell'host deve attenersi scrupolosamente a queste specifiche.

source: The host sends this command to cause the decoder to beep.
it_it: L'host invia questo comando per far emettere un segnale acustico al decoder.

source: The host then transmits either CMD_NAK, resend to instruct the decoder to resend the entire message, or CMD_NAK, cancel to cancel the transmission completely.
it_it: L'host trasmette quindi CMD_NAK, "resend" per indicare al decoder di reinviare l'intero messaggio, oppure CMD_NAK, "cancel" per annullare completamente la trasmissione.

source: The hosts should query this parameter periodically.
it_it: Gli host dovrebbero interrogare questo parametro periodicamente.

source: The index output signals the microstep counter zero position, to allow the application to reference the drive to a certain current pattern.
it_it: L'indice dell'output segnala la posizione zero del contatore dei micropassi, per consentire all'applicazione di fare riferimento all'azionamento a un determinato pattern corrente.

source: The integrated 32-bit motion controller automatically drives the motor to target positions or accelerates to target velocities.
it_it: Il controller di movimento integrato a 32 bit guida automaticamente il motore verso le posizioni target o accelera fino alle velocità target.

source: The integrated motion controller supports immediate reaction to mechanical reference switches and to the sensorless stall detection StallGuard2.
it_it: Il controller di movimento integrato supporta una reazione immediata agli switch di riferimento meccanici e al rilevamento di stallo senza sensori StallGuard2.

source: The last packet has the continuation bit cleared (0).
it_it: L'ultimo pacchetto ha il bit di continuazione azzerato (0).

source: The load angle depends on the external torque applied to the axis of the stepper motor.
it_it: L'angolo di carico dipende dalla coppia esterna applicata all'asse del motore passo-passo.

source: The load angle is the angle between the magnetic orientation of rotor and stator.
it_it: L'angolo di carico è l'angolo tra l'orientamento magnetico del rotore e quello dello statore.

source: The load motor #2 periodically loses four full steps because of its lower current, at that point the mechanical load vanishes for a short time (Figure 2.8, Figure 2.9).
it_it: Il motore di carico #2 perde periodicamente quattro passi completi a causa della sua corrente inferiore, a quel punto il carico meccanico scompare per un breve periodo (Figura 2.8, Figura 2.9).

source: The lower value of SG slightly increases with increasing supply voltage.
it_it: Il valore inferiore di SG aumenta leggermente con l'aumentare della tensione di alimentazione.

source: The magnetic orientation of the rotor is assigned to the mechanical angle of the axis of a stepper motor.
it_it: L'orientamento magnetico del rotore è assegnato all'angolo meccanico dell'asse di un motore passo-passo.

source: The magnetic orientation of the stator results from the phase currents feed through the coils of the stepper motor.
it_it: L'orientamento magnetico dello statore è determinato dalle correnti di fase che attraversano le bobine del motore passo-passo.

source: The maximum length of a packet is 257 bytes, consisting of a checksum (two bytes), a header (four bytes), and up to 251 characters of data.
it_it: La lunghezza massima di un pacchetto è di 257 byte, composta da un checksum (due byte), un'intestazione (quattro byte) e fino a 251 caratteri di dati.

source: The maximum possible load for a stepper without stall is one full step.
it_it: Il carico massimo possibile per un motore passo-passo senza stallo è un passo completo.

source: The measurement error of StallGuard2 – provided that all other parameters remain stable – can be as low as:
it_it: L'errore di misurazione di StallGuard2, a condizione che tutti gli altri parametri rimangano stabili, può essere basso quanto:

source: The most common and most beneficial use is to adapt CoolStep for operation at the typical system target operation velocity and to set the velocity thresholds according.
it_it: L'uso più comune e più vantaggioso è adattare CoolStep per il funzionamento alla velocità operativa target tipica del sistema e impostare le soglie di velocità di conseguenza.

source: The most significant bit is sent first.
it_it: Il bit più significativo viene inviato per primo.

source: The motion controller recalculates immediately.
it_it: Il controller di movimento esegue immediatamente i calcoli.

source: The motor can optionally be controlled by a step and direction input.
it_it: Il motore può essere opzionalmente controllato da un ingresso step e direzione.

source: The motor coils must be able to follow the sign wave, i.e., the velocity must not exceed the value where the Back-EMF plus the resistive voltage loss of the motor exceeds the supply voltage.
it_it: Le bobine del motore devono essere in grado di seguire l'onda di segno, ovvero la velocità non deve superare il valore per cui la forza controelettromotrice più la perdita di tensione resistiva del motore supera la tensione di alimentazione.

source: The motor moves as fast as possible and never loses a step.
it_it: Il motore si muove alla massima velocità possibile e non perde mai un passo.

source: The motor operates free of vibration at low velocities.
it_it: Il motore funziona senza vibrazioni a basse velocità.

source: The node is enabled for an SPI transaction by a low on the chip select input CSN.
it_it: Il nodo è abilitato per una transazione SPI da un livello basso sul CSN dell'ingresso chip select.

source: The only motion controller registers remaining active in this case are the current settings in register IHOLD_IRUN.
it_it: Gli unici registri del controller di movimento che rimangono attivi in ​​questo caso sono le impostazioni correnti nel registro IHOLD_IRUN.

source: The optimum setting is reached when SG_RESULT is between 0 and roughly 100 at increasing load shortly before the motor stalls, and SG_RESULT increases by 100 or more without load.
it_it: L'impostazione ottimale si raggiunge quando SG_RESULT è compreso tra 0 e circa 100 con carico crescente poco prima che il motore vada in stallo, e SG_RESULT aumenta di 100 o più senza carico.

source: The optimum setting is reached when a stall is safely detected and leads to a pulse at DIAG in the moment where the stall occurs
it_it: L'impostazione ottimale si raggiunge quando viene rilevato uno stallo in modo sicuro e genera un impulso in DIAG nel momento in cui si verifica lo stallo.

source: The orange bar is representing the maximum current and SEIMIN value.
it_it: La barra arancione rappresenta la corrente massima e il valore SEIMIN.

source: The part of energy going back to the power supply decreases.
it_it: La parte di energia che torna all'alimentazione diminuisce.

source: The power supply voltage also affects SG_RESULT, so tighter regulation results in more accurate values.
it_it: Anche la tensione di alimentazione influisce su SG_RESULT, quindi una regolazione più rigorosa si traduce in valori più accurati.

source: The read and clear function of the event_stop_sg flag in RAMP_STAT would restart the motor after expiration of TZEROWAIT in case the motion parameters have not been modified.
it_it: La funzione di lettura e cancellazione del flag event_stop_sg in RAMP_STAT riavvia il motore dopo la scadenza di TZEROWAIT nel caso in cui i parametri di movimento non siano stati modificati.

source: The read and write selection is controlled by the MSB of the address byte (bit 39 of the SPI datagram).
it_it: La selezione di lettura e scrittura è controllata dal bit MSB del byte di indirizzo (bit 39 del datagramma SPI).

source: The red line represents the current into the motor coils.
it_it: La linea rossa rappresenta la corrente nelle bobine del motore.

source: The register name differs from IC to IC so please review the specific driver’s datasheet to find the proper register.
it_it: Il nome del registro varia da circuito integrato a circuito integrato, quindi consultare la scheda tecnica del driver specifico per trovare il registro corretto.

source: The response at an SGT setting at or near 0 gives some idea on the quality of the signal: Check the SG_RESULT value without load and with maximum load.
it_it: La risposta con un'impostazione di SGT pari o prossima a 0 fornisce un'idea della qualità del segnale: Controllare il valore di SG_RESULT senza carico e con carico massimo.

source: The response to the host transmission is given by the decoder before the transmission pending.
it_it: La risposta alla trasmissione dell'host viene fornita dal decoder prima che la trasmissione sia in sospeso.

source: The security of this transaction is not guaranteed.
it_it: La sicurezza di questa transazione non è garantita.

source: The setup is outlined in Figure 2.4 and Figure 2.5.
it_it: La configurazione è illustrata nelle Figure 2.4 e 2.5.

source: The single wire interface allows differential operation similar to RS485 (using SWIOP and SWION) or single wire interfacing (leaving open SWION).
it_it: L'interfaccia a filo singolo consente un funzionamento differenziale simile a RS485 (utilizzando SWIOP e SWION) o un'interfaccia a filo singolo (lasciando SWION aperto).

source: The stall detection is disabled outside the determined operation point, e.g. during acceleration phases preceding a sensorless homing procedure when setting TCOOLTHRS to a matching value.
it_it: Il rilevamento dello stallo viene disabilitato al di fuori del punto operativo determinato, ad esempio durante le fasi di accelerazione che precedono una procedura di homing senza sensori, impostando TCOOLTHRS su un valore corrispondente.

source: The stall guard graph is right now at 0.
it_it: Il grafico di StallGuard è attualmente a 0.

source: The stall output becomes active if SG_RESULT falls below this value.
it_it: L'output di stallo si attiva se SG_RESULT scende al di sotto di questo valore.

source: The stall output signal allows StallGuard2 to be handled by the external motion controller like a stop switch.
it_it: Il segnale di uscita di stallo consente a StallGuard2 di essere gestito dal controller di movimento esterno come un fine-corsa.

source: The stall threshold should be a value safely within the operating limits, to allow for parameter stray.
it_it: La soglia di stallo dovrebbe essere un valore che rientra nei limiti operativi, per consentire la dispersione dei parametri.

source: The stator is static, and the rotor is rotating.
it_it: Lo statore è statico e il rotore è in rotazione.

source: The stop condition also is indicated by the flag StallGuard in DRV_STATUS.
it_it: La condizione di arresto è indicata anche dal flag StallGuard in DRV_STATUS.

source: The supply voltage is constant within a specified range of tolerance.
it_it: La tensione di alimentazione è costante entro un intervallo di tolleranza specificato.

source: The switch named SFILT is available for filtering off the StallGuard2 values SG.
it_it: Lo switch denominato SFILT è disponibile per filtrare i valori SG di StallGuard2.

source: The system clock frequency affects SG_RESULT.
it_it: La frequenza di clock di sistema influisce su SG_RESULT.

source: The torque between two coupled stepper motors that rotate against each other is the applied torque.
it_it: La coppia tra due motori passo-passo accoppiati che ruotano l'uno contro l'altro è la coppia applicata.

source: The upper threshold is (SEMIN + SEMAX + 1)*32.
it_it: La soglia superiore è (SEMIN + SEMAX + 1)*32.

source: The upper value of SG representing NO LOAD decreases with increasing supply voltage.
it_it: Il valore superiore di SG, che rappresenta la condizione di SENZA CARICO, diminuisce con l'aumentare della tensione di alimentazione.

source: The upper velocity for the stall detection with this setting is determined by the velocity, where the motor back EMF approaches the supply voltage, and the motor current starts dropping when further increasing velocity.
it_it: La velocità massima per il rilevamento dello stallo con questa impostazione è determinata dalla velocità, in cui la forza controelettromotrice del motore si avvicina alla tensione di alimentazione e la corrente del motore inizia a diminuire con un ulteriore aumento della velocità.

source: The value goes up to the IRUN value and down to the portion of IRUN as specified by SEIMIN.
it_it: Il valore sale fino al valore IRUN e scende fino alla porzione di IRUN come specificato da SEIMIN.

source: Then run both motors at identical speed.
it_it: Quindi far girare entrambi i motori alla stessa velocità.

source: There are two cases where the host may make the CTS line inactive before the message is complete.
it_it: Ci sono due casi in cui l'host può rendere inattiva la linea CTS prima che il messaggio sia completo.

source: There, one can see that the StallGuard2 value SG changes with the change of current.
it_it: Qui si può osservare che il valore SG di StallGuard2 cambia al variare della corrente.

source: Therefore, VCC must not be lost during operation of the chip.
it_it: Pertanto, VCC non deve essere perso durante il funzionamento del chip.

source: Therefore, in order to set the velocity of 1 revolution per second, we have to enter 53687 as the target velocity in the velocity mode window.
it_it: Pertanto, per impostare la velocità di 1 giro al secondo, dobbiamo inserire 53687 come velocità target nella finestra della modalità velocità.

source: Therefore, it is important to understand its limitations.
it_it: Pertanto, è importante comprenderne i limiti.

source: Therefore, mechanical load will not make a big difference on the result.
it_it: Pertanto, il carico meccanico non inciderà in modo significativo sul risultato.

source: Therefore, the DIAG outputs supply a configurable set of different real time information complementing the STEP/DIR interface.
it_it: Pertanto, le uscite DIAG forniscono un insieme configurabile di diverse informazioni in tempo reale che completano l'interfaccia STEP/DIR.

source: Therefore, the applicable velocity range for StallGuard is limited to something in between low and high velocities.
it_it: Pertanto, l'intervallo di velocità applicabile per StallGuard è limitato a un intervallo compreso tra velocità basse e alte.
